# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-eid'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bat' # "cat" on steroids
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'fzf'
brew 'gh'
brew 'git'
brew 'gnupg2'
brew 'grep'
brew 'httpie'
brew 'hub'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/e0
brew 'starship'
brew 'stripe'
brew 'svn'
brew 'tmux'
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'zlib' # Needed for Memcached

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'php'
brew 'composer'
brew 'imagemagick'
brew 'libmemcached'
brew 'memcached'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'postgresql'
brew 'python'
brew 'redis'
brew 'yarn'

# Apps
cask 'alfred'
cask 'bartender'
cask 'bitwarden'
cask 'bitwarden-cli'
cask 'caffeine'
cask 'dbngin'
cask 'discord'
cask 'docker'
cask 'figma'
cask 'firefox'
cask 'github'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'gpg-suite'
cask 'imageoptim'
cask 'insomnia'
cask 'iterm2'
cask 'java'
cask 'mysqlworkbench'
cask 'phpstorm'
cask 'slack'
cask 'spotify'
cask 'sublime-merge'
cask 'sublime-text'
cask 'tableplus'
cask 'telegram-desktop'
cask 'the-unarchiver'
cask 'tinkerwell'
cask 'vagrant'
cask 'virtualbox' # Might need to allow access in Security settings
cask 'virtualbox-extension-pack'
cask 'visual-studio-code'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-poppins'
cask 'font-roboto'
cask 'font-roboto-condensed'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Bear', id: 1091189122
mas 'Contrast — Color Accessibility', id: 1254981365
mas 'Frank DeLoupe', id: 530458789
mas 'Magnet', id: 441258766
mas 'Moom', id: 419330170
mas 'Spark', id: 1176895641
